<center>
<img src="../../img/ods_stickers.jpg" />
    
## [mlcourse.ai](mlcourse.ai) â€“ Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

<h1><center>Assignment #1. Fall 2018</center></h1>
<h2><center>Exploratory data analysis of Olympic games with Pandas</center></h2>

__There are ten questions about [120 years of Olympic history: athletes and results](https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results/version/2) dataset in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/179HYvlF_0x435CWdu2aOtR9a3flh0YCQXXNXhXaKw2M).__

Download the file `athlete_events.csv` from [Kaggle page](https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results). The dataset has the following features (copied from Kaggle):

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [1]:
import pandas as pd

In [10]:
# Change the path to the dataset file if needed. 
PATH = 'https://raw.githubusercontent.com/iknyazeva/ML2020/master/assignments/datasets/athlete_events.csv'

In [11]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [4]:
data['Year']==1996

0         False
1         False
2         False
3         False
4         False
          ...
271111    False
271112    False
271113    False
271114    False
271115    False
Name: Year, Length: 271116, dtype: bool

__1. How old were the youngest male and female participants of the 1996 Olympics?__

- 16 and 15
- 14 and 12 
- 16 and 12
- 13 and 11

In [5]:
#data.loc[data['Games'].str.contains('1992')].groupby('Sex')['Age'].min()
data.loc[data['Games'].str.contains('1992')].groupby('Sex')['Age'].describe()

       count       mean       std   min   25%   50%   75%   max
Sex
F     5171.0  22.940437  5.198453  12.0  19.0  23.0  26.0  53.0
M    11198.0  24.955438  5.028283  11.0  22.0  24.0  27.0  62.0

__2. What was the percentage of male gymnasts among all the male participants of the 2000 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

- 0.2
- 1.5 
- 2.5
- 7.7

In [6]:
pd.unique(data['Sport'])

array(['Basketball', 'Judo', 'Football', 'Tug-Of-War', 'Speed Skating',
       'Cross Country Skiing', 'Athletics', 'Ice Hockey', 'Swimming',
       'Badminton', 'Sailing', 'Biathlon', 'Gymnastics',
       'Art Competitions', 'Alpine Skiing', 'Handball', 'Weightlifting',
       'Wrestling', 'Luge', 'Water Polo', 'Hockey', 'Rowing', 'Bobsleigh',
       'Fencing', 'Equestrianism', 'Shooting', 'Boxing', 'Taekwondo',
       'Cycling', 'Diving', 'Canoeing', 'Tennis', 'Modern Pentathlon',
       'Figure Skating', 'Golf', 'Softball', 'Archery', 'Volleyball',
       'Synchronized Swimming', 'Table Tennis', 'Nordic Combined',
       'Baseball', 'Rhythmic Gymnastics', 'Freestyle Skiing',
       'Rugby Sevens', 'Trampolining', 'Beach Volleyball', 'Triathlon',
       'Ski Jumping', 'Curling', 'Snowboarding', 'Rugby',
       'Short Track Speed Skating', 'Skeleton', 'Lacrosse', 'Polo',
       'Cricket', 'Racquets', 'Motorboating', 'Military Ski Patrol',
       'Croquet', 'Jeu De Paume', 'Roque', 'Alpinism', 'Basque Pelota',
       'Aeronautics'], dtype=object)

In [7]:
data['Sport']

0            Basketball
1                  Judo
2              Football
3            Tug-Of-War
4         Speed Skating
              ...
271111             Luge
271112      Ski Jumping
271113      Ski Jumping
271114        Bobsleigh
271115        Bobsleigh
Name: Sport, Length: 271116, dtype: object

In [8]:
numMenHymn = len(pd.unique(data.loc[(data['Games'].str.contains('2000'))&(data['Sport']=='Gymnastics')&(data['Sex']=='M')]['Name']))
numMenAll = len(pd.unique(data.loc[(data['Games'].str.contains('2000'))&(data['Sex']=='M')]['Name']))

100*numMenHymn/numMenAll

1.4750608272506083

__3. What are the mean and standard deviation of height for female basketball players participated in the 2000 Olympics? Round the answer to the first decimal.__

- 178.5 and 7.2
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [36]:
# You code here 
data.loc[(data['Games'].str.contains('2000'))&(data['Sport']=='Basketball')].drop_duplicates(subset = ['Name']).groupby('Sex')['Height'].describe()
#data.loc[(data['Games'].str.contains('2000'))&(data['Sport']=='Basketball')].groupby('Sex')['Height'].describe()

     count        mean       std    min    25%    50%     75%    max
Sex
F    142.0  182.387324  9.139462  162.0  175.0  182.0  190.00  213.0
M    144.0  199.493056  9.005046  178.0  193.0  198.0  205.25  226.0

__4. Find a sportsperson participated in the 2002 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

- Judo
- Bobsleigh 
- Weightlifting
- Boxing

In [28]:
# You code here 
print(data.loc[data['Games'].str.contains('2002')]['Weight'].describe())
data.loc[(data['Games'].str.contains('2002'))&(data['Weight']>=123)]

count    4062.000000
mean       71.197070
std        13.257178
min        42.000000
25%        61.000000
50%        69.000000
75%        80.000000
max       123.000000
Name: Weight, dtype: float64

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
99154,50171,Emmanuel Hostache,M,26.0,190.0,123.0,France,FRA,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Two,NaN

__5. How many times did Pawe Abratkiewicz participate in the Olympics held in different years?__

- 0
- 1 
- 2
- 3

In [31]:
# You code here,3 
data.loc[data['Name'].str.contains('Pawe Abratkiewicz')].groupby('Year').count()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Season,City,Sport,Event,Medal
Year,,,,,,,,,,,,,,
1992,2,2,2,2,2,2,2,2,2,2,2,2,2,0
1998,2,2,2,2,2,2,2,2,2,2,2,2,2,0
2002,2,2,2,2,2,2,2,2,2,2,2,2,2,0

__6. How many silver medals in tennis did Australia win at the 2000 Olympics?__

- 0
- 1 
- 2 
- 3

In [38]:
# You code here 
#2
data.loc[(data['Games'].str.contains('2000'))&(data['Team']=='Australia')].groupby(['Sport','Medal'])['Medal'].count()

Sport          Medal
Archery        Gold       1
Athletics      Gold       1
               Silver     2
Basketball     Silver    12
Canoeing       Bronze     1
               Silver     2
Cycling        Bronze     5
               Gold       2
               Silver     2
Diving         Bronze     4
Equestrianism  Gold       4
               Silver     1
Hockey         Bronze    16
               Gold      16
Judo           Bronze     1
Rowing         Bronze     6
               Silver    15
Sailing        Bronze     1
               Gold       4
               Silver     2
Shooting       Bronze     1
               Gold       1
               Silver     1
Softball       Bronze    15
Swimming       Bronze     4
               Gold      15
               Silver    27
Taekwondo      Gold       1
               Silver     1
Tennis         Silver     2
Trampolining   Silver     1
Triathlon      Silver     1
Water Polo     Gold      13
Name: Medal, dtype: int64

__7. Is it true that Switzerland won fewer medals than Serbia at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

- Yes 
- No

In [42]:
# You code here, NO 
data.loc[(data['Games'].str.contains('2016'))&(data['Team'].str.contains('Serbia'))]['Medal'].value_counts()

Silver    27
Gold      14
Bronze    13
Name: Medal, dtype: int64

In [43]:
data.loc[(data['Games'].str.contains('2016'))&(data['Team'].str.contains('Switzerland'))]['Medal'].value_counts()

Gold      6
Silver    3
Bronze    2
Name: Medal, dtype: int64

__8. What age category did the fewest and the most participants of the 2014 Olympics belong to?__
- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45] and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [45]:
# You code here [45-55] and [25-35) correspondinglypn
data.loc[(data['Games'].str.contains('2014'))]['Age'].describe()

count    4891.000000
mean       25.987324
std         4.849456
min        15.000000
25%        23.000000
50%        26.000000
75%        29.000000
max        55.000000
Name: Age, dtype: float64

In [23]:
data['AgeRange']=  pd.cut(data['Age'], [15,24.99,34.99,45.99,55],include_lowest=True)

In [27]:
data.loc[data['Games'].str.contains('2014')].drop_duplicates(subset = ['Name'])['AgeRange'].value_counts()

(24.99, 34.99]     1396
(14.999, 24.99]    1193
(34.99, 45.99]      151
(45.99, 55.0]         4
Name: AgeRange, dtype: int64

In [51]:
data.loc[(data['Games'].str.contains('2014'))].drop_duplicates(subset = ['Name'])['Age'].describe()

count    2744.000000
mean       25.819242
std         5.029564
min        15.000000
25%        22.000000
50%        25.000000
75%        29.000000
max        55.000000
Name: Age, dtype: float64

__9. Is it true that there were Summer Olympics held in Lake Placid? Is it true that there were Winter Olympics held in Sankt Moritz?__

- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [30]:
# You code here No, Yes 
data.loc[data['City'].str.contains('Lake Placid')]['Season'].value_counts()

Winter    2098
Name: Season, dtype: int64

In [32]:
data.loc[data['City'].str.contains('Sankt Moritz')]['Season'].value_counts()

Winter    1657
Name: Season, dtype: int64

__10. What is the absolute difference between the number of unique sports at the 1995 Olympics and 2016 Olympics?__

- 16
- 24
- 26
- 34

In [62]:
# You code here  34
pd.unique(data['Year'])

array([1992, 2012, 1920, 1900, 1988, 1994, 1932, 2002, 1952, 1980, 2000,
       1996, 1912, 1924, 2014, 1948, 1998, 2006, 2008, 2016, 2004, 1960,
       1964, 1984, 1968, 1972, 1936, 1956, 1928, 1976, 2010, 1906, 1904,
       1908, 1896])

In [75]:
print('In 1996:',len(pd.unique(data.loc[data['Year']==1996]['Event'])))
print('In 2016:',len(pd.unique(data.loc[data['Year']==2016]['Event'])))

In 1996: 271
In 2016: 306

In [33]:
print('In 2016:',len(pd.unique(data.loc[data['Year']==2016]['Sport'])))

In 2016: 34